nc: 3  

backbone:
  - [-1, 1, CSWinTransformer, []]              
  - [0, 1, Stage, [0]]                                         #1  P3/8
  - [0, 1, Stage, [1]]                                         #2  P4/16
  - [0, 1, Stage, [2]]                                         #3  P5/32

head:
  - [3, 1, nn.Upsample, [None, 2, "nearest"]]                 #4 (P5 upsampled to P4 size)
  - [[4, 2], 1, Concat, [1]]                                   #5 (Concat upsampled P5 with P4)
  - [-1, 3, C2f, [512]]                                        #6  P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                #7 (P4 upsampled to P3 size)
  - [[7, 1], 1, Concat, [1]]                                   #8 (Concat upsampled P4 with P3)
  - [-1, 3, C2f, [256]]                                        #9 P3

  - [-1, 1, Conv, [256, 3, 2]]                                #10 (P3 downsampled to P4 size)
  - [[10, 6], 1, Concat, [1]]                                  #11 (Concat downsampled P3 with P4)
  - [-1, 3, C2f, [512]]                                        #12 P4

  - [-1, 1, Conv, [512, 3, 2]]                                #13 (P4 downsampled to P5 size)
  - [[13, 4], 1, Concat, [1]]                                  #14 (Concat downsampled P4 with P5)
  - [-1, 3, C2fCIB, [1024, True, True]]                        #15 P5

  - [[9, 12, 15], 1, v10Detect, [nc]]                         #16 [P3, P4, P5]
