nc: 20

backbone:
  # [from, repeats, module, args]
  - [-1, 1, CSWinStem, [3, 64]] # 0
  - [-1, 1, CSWinStage, [1, 1, 1]] # 1
  - [-1, 1, Reshape, []] # 2

  - [-1, 1, CSWinDownsample, [64, 128]] # 3
  - [-1, 1, CSWinStage, [2, 2, 2]] # 4
  - [-1, 1, Reshape, []] # 5

  - [-1, 1, CSWinDownsample, [128, 256]] # 6
  - [-1, 1, CSWinStage, [8, 4, 8]] # 7
  - [-1, 1, Reshape, []] # 8

  - [-1, 1, CSWinDownsample, [256, 512]] # 9
  - [-1, 1, CSWinStage, [1, 8, 8]] # 10
  - [-1, 1, Reshape, []] # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                 #12 
  - [[-1, 8], 1, Concat, [1]]                                  #13 
  - [-1, 3, C2f, [512]]                                        #14  P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                 #15 
  - [[-1, 5], 1, Concat, [1]]                                  #16 
  - [-1, 3, C2f, [256]]                                        #17 P3

  - [-1, 1, Conv, [256, 3, 2]]                                 #18 
  - [[-1, 14], 1, Concat, [1]]                                 #19
  - [-1, 3, C2f, [512]]                                        #20 P4

  - [-1, 1, Conv, [512, 3, 2]]                                 #21
  - [[-1, 11], 1, Concat, [1]]                                 #22
  - [-1, 3, C2fCIB, [1024, True, True]]                        #23 P5

  - [[17, 20, 23], 1, v10Detect, [nc]]                         #[P3, P4, P5]