nc: 3

backbone:
  - [-1, 1, SwinTransformerV2, []]                             #0  Backbone
  - [0, 1, Stage, [0]]                                         #1  C=96 (P4)
  - [0, 1, Stage, [1]]                                         #2  C=192 (P8)
  - [0, 1, Stage, [2]]                                         #3  C=384 (P16)
  - [0, 1, Stage, [3]]                                         #4  C=768 (P32)

head:
  # Path P5->P4
  - [4, 1, Conv, [384, 1, 1]]                                  # 5. C=768 -> 384
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                 # 6. Upsample
  - [[-1, 3], 1, Concat, [1]]                                  # 7. (384 + 384) = 768
  - [-1, 3, C2f, [384]]                                        # 8. P4 (C=384)

  # Path P4->P3
  - [-1, 1, Conv, [192, 1, 1]]                                 # 9. C=384 -> 192
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                 # 10. Upsample
  - [[-1, 2], 1, Concat, [1]]                                  # 11. (192 + 192) = 384
  - [-1, 3, C2f, [192]]                                        # 12. P3 (C=192)

  # Path P3->P4
  - [-1, 1, Conv, [384, 3, 2]]                                 # 13. C=192 -> 384, Downsample
  - [[13, 8], 1, Concat, [1]]                                  # 14. (384 + 384) = 768
  - [-1, 3, C2f, [384]]                                        # 15. P4 (C=384)

  # Path P4->P5
  - [-1, 1, Conv, [768, 3, 2]]                                 # 16. C=384 -> 768, Downsample
  - [[16, 4], 1, Concat, [1]]                                  # 17. (768 + 768) = 1536
  - [-1, 3, C2fCIB, [768, True, True]]                        # 18. P5 (C=768)

  - [[12, 15, 18], 1, v10Detect, [nc]]                         # 19. [P3, P4, P5]