nc: 3

backbone:
  # [from, repeats, module, args]
  - [-1, 1, CSWinStem, [3, 96]] # 0
  - [-1, 1, CSWinStage, [2, 3]] # 1
  - [-1, 1, Reshape, []] # 2

  - [-1, 1, CSWinDownsample, [96, 192]] # 3
  - [-1, 1, CSWinStage, [2, 6]] # 4
  - [-1, 1, Reshape, []] # 5

  - [-1, 1, CSWinDownsample, [192, 384]] # 6
  - [-1, 1, CSWinStage, [6, 12]] # 7
  - [-1, 1, Reshape, []] # 8

  - [-1, 1, CSWinDownsample, [384, 768]] # 9
  - [-1, 1, CSWinStage, [2, 24]] # 10
  - [-1, 1, Reshape, []] # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                 #12 
  - [[-1, 8], 1, Concat, [1]]                                  #13 
  - [-1, 3, C2f, [384]]                                        #14  P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                 #15 
  - [[-1, 5], 1, Concat, [1]]                                  #16 
  - [-1, 3, C2f, [192]]                                        #17 P3

  - [-1, 1, Conv, [192, 3, 2]]                                 #18 
  - [[-1, 14], 1, Concat, [1]]                                 #19
  - [-1, 3, C2f, [384]]                                        #20 P4

  - [-1, 1, Conv, [384, 3, 2]]                                 #21
  - [[-1, 11], 1, Concat, [1]]                                 #22
  - [-1, 3, C2fCIB, [768, True, True]]                         #23 P5

  - [[17, 20, 23], 1, v10Detect, [nc]]                         #[P3, P4, P5]