nc: 3  

backbone:
  - [-1, 1, SwinTransformerV2, []]                             #0  Backbone
  - [0, 1, Stage, [0]]                                         #1  P/4
  - [0, 1, Stage, [1]]                                         #2  P3/8
  - [0, 1, Stage, [2]]                                         #3  P4/16
  - [0, 1, Stage, [3]]                                         #4  P5/32

head:
  - [4, 1, nn.Upsample, [None, 2, "nearest"]]                  #5 
  - [[5, 3], 1, Concat, [1]]                                   #6 
  - [-1, 3, C2f, [384]]                                        #7  P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                 #8 
  - [[8, 2], 1, Concat, [1]]                                   #9 
  - [-1, 3, C2f, [192]]                                        #10 P3

  - [-1, 1, Conv, [192, 3, 2]]                                 #11 
  - [[11, 7], 1, Concat, [1]]                                  #12
  - [-1, 3, C2f, [384]]                                        #13 P4

  - [-1, 1, Conv, [384, 3, 2]]                                 #14
  - [[14, 4], 1, Concat, [1]]                                  #15
  - [-1, 3, C2fCIB, [768, True, True]]                        #16 P5

  - [[10, 13, 16], 1, v10Detect, [nc]]                         #17 [P3, P4, P5]